JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_adapter.c
/*
 * BK7258 NuttX owner for the Armino Wi-Fi OS capability ABI.
 *
 * The generated wifi_os_funcs_t/wifi_os_variable_t declarations are retained
 * verbatim. This file only assembles already-owned NuttX providers; the
 * original Armino bk_wifi_adapter.c remains the field/semantic reference and
 * is intentionally not compiled because it is lwIP/FreeRTOS-bound.
 */

#include <nuttx/config.h>
#include <nuttx/cache.h>
#include <nuttx/kmalloc.h>

#include <assert.h>
#include <errno.h>
#include <arpa/inet.h>
#include <stdarg.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>

#include <common/bk_include.h>
#include <bk_ps.h>
#include <bk_sys_ctrl.h>
#include <driver/int.h>
#include <driver/aon_rtc.h>
#include <generated/lmac_wifi_adapter.h>
#include <gpio_driver.h>
#include <modules/pm.h>
#include <sys_types.h>
#include "bk_phy_internal.h"
#include "bk_rf_internal.h"
#include "bk_phy_adapter.h"
#include "bk_private/bk_wifi.h"

#include <arch/chip/bk7258_sysctrl.h>
#include <arch/chip/bk7258_clock.h>

#include "bk7258_wifi_internal.h"
#include "bk_feature.h"
#include "os/mem.h"
#include "os/os.h"
#include "os/str.h"
#include "stack_base.h"
#include "sys_driver.h"
#include "sys_ll.h"

extern bk_err_t dma_memcpy(void *out, const void *in, uint32_t len);
extern void bk_printf(const char *fmt, ...);
extern void bk_printf_ext(int level, char *tag, const char *fmt, ...);
extern void bk_null_printf(const char *fmt, ...);
extern void bk_printf_raw(int level, char *tag, const char *fmt, ...);
extern bk_err_t bk_wifi_interrupt_init(void);
extern bool ate_is_enabled(void);
extern void *bk_pbuf_alloc_wrapper(int layer, uint16_t length, int type);
extern void bk_pbuf_free_wrapper(void *p);
extern void bk_pbuf_ref_wrapper(void *p);
extern void bk_pbuf_header_wrapper(void *p, int16_t len);
extern void bk_pbuf_cat_wrapper(void *p, void *q);
extern void *bk_pbuf_coalesce_wrapper(void *p);
extern int bk_get_rx_pbuf_type_wrapper(void);
extern int bk_get_pbuf_pool_size_wrapper(void);

extern bk_err_t rtos_lock_mutex(beken_mutex_t *mutex);
extern bk_err_t rtos_unlock_mutex(beken_mutex_t *mutex);
extern void bk7258_wifi_adapter_register_callbacks(void);
/* Declared by bk_phy_adapter.h.  Keep these explicit because this adapter
 * otherwise only needs the smaller PHY-internal API surface. */
extern void rwnx_cal_mac_sleep_rc_clr(void);
extern void rwnx_cal_mac_sleep_rc_recover(void);
extern int rw_msg_send(const void *msg_params, int reqcfm, uint16_t reqid,
                       void *cfm);
extern UINT8 rw_ieee80211_init_scan_chan(void *req);
extern UINT8 rw_ieee80211_get_scan_default_chan_num(void);
extern void rwnx_set_wifi_rlk_start(uint32_t start);
extern uint32_t sr_get_scan_number(void);
extern void *sr_get_scan_results(void);
extern void sr_flush_scan_results(void *rst_ptr);
extern void *rwnx_get_rlk_info_results(void);
extern void rwnx_flush_rlk_info_results(void);
extern void net_begin_send_arp_reply(int is_send_arp, int is_allow_send_req);

static char *bk7258_wifi_strdup_cb(const char *s) { return strdup(s); }
static unsigned int bk7258_wifi_strlcpy_cb(char *d, const char *s, size_t n)
{
  return strlcpy(d, s, n);
}
static INT32 bk7258_wifi_snprintf_cb(char *d, UINT32 n, const char *f, ...)
{
  va_list ap;
  int ret;
  va_start(ap, f);
  ret = vsnprintf(d, n, f, ap);
  va_end(ap);
  return (INT32)ret;
}
static UINT32 bk7258_wifi_strtoul_cb(const char *s, char **e, int b)
{
  return (UINT32)strtoul(s, e, b);
}
static INT32 bk7258_wifi_strcasecmp_cb(const char *a, const char *b)
{
  return strcasecmp(a, b);
}
static INT32 bk7258_wifi_strncasecmp_cb(const char *a, const char *b, UINT32 n)
{
  return strncasecmp(a, b, n);
}
static bk_err_t bk7258_wifi_lock_mutex_cb(void **mutex)
{
  return rtos_lock_mutex((beken_mutex_t *)mutex);
}
static bk_err_t bk7258_wifi_unlock_mutex_cb(void **mutex)
{
  return rtos_unlock_mutex((beken_mutex_t *)mutex);
}

/* The vendor runtime declares these as externally visible pointers. They are
 * statically bound to the NuttX-owned tables, but this object never calls
 * bk_wifi_init(); runtime startup remains explicitly disabled. */
extern wifi_os_funcs_t g_wifi_os_funcs;
extern wifi_os_variable_t g_wifi_os_variable;
wifi_os_funcs_t *g_wifi_funcs = &g_wifi_os_funcs;
wifi_os_variable_t *g_wifi_vars = &g_wifi_os_variable;

static void *bk7258_wifi_os_malloc_cb(const char *func, int line, size_t size)
{
  (void)func;
  (void)line;
  return bk7258_wifi_osal_malloc(size);
}

static void *bk7258_wifi_os_zalloc_cb(const char *func, int line, size_t size)
{
  (void)func;
  (void)line;
  return bk7258_wifi_osal_zalloc(size);
}

static void bk7258_wifi_os_free_cb(void *ptr)
{
  bk7258_wifi_osal_free(ptr);
}

static void *bk7258_wifi_os_realloc_cb(void *ptr, size_t size)
{
  return bk7258_wifi_osal_realloc(ptr, size);
}

static INT32 bk7258_wifi_memcmp_cb(const void *a, const void *b, UINT32 n)
{
  return (INT32)memcmp(a, b, n);
}

static void *bk7258_wifi_memset_cb(void *dst, int value, UINT32 n)
{
  return memset(dst, value, n);
}

static void *bk7258_wifi_memcpy_cb(void *dst, const void *src, UINT32 n)
{
  return memcpy(dst, src, n);
}

static void *bk7258_wifi_memmove_cb(void *dst, const void *src, UINT32 n)
{
  return memmove(dst, src, n);
}

static UINT32 bk7258_wifi_strlen_cb(const char *str)
{
  return (UINT32)strlen(str);
}

static INT32 bk7258_wifi_strcmp_cb(const char *a, const char *b)
{
  return (INT32)strcmp(a, b);
}

static INT32 bk7258_wifi_strncmp_cb(const char *a, const char *b, UINT32 n)
{
  return (INT32)strncmp(a, b, n);
}

static char *bk7258_wifi_strcpy_cb(char *dst, const char *src)
{
  return strcpy(dst, src);
}

static char *bk7258_wifi_strncpy_cb(char *dst, const char *src, UINT32 n)
{
  return strncpy(dst, src, n);
}

static char *bk7258_wifi_strchr_cb(const char *str, int ch)
{
  return (char *)strchr(str, ch);
}

static char *bk7258_wifi_strrchr_cb(const char *str, int ch)
{
  return (char *)strrchr(str, ch);
}

static char *bk7258_wifi_strstr_cb(const char *haystack, const char *needle)
{
  return (char *)strstr(haystack, needle);
}

static void bk7258_wifi_delay_cb(INT32 ticks)
{
  if (ticks > 0)
    {
      bk7258_wifi_osal_delay_ms((uint32_t)ticks);
    }
}

static void bk7258_wifi_delay_us_cb(UINT32 usec)
{
  bk7258_wifi_osal_delay_us(usec);
}

static int bk7258_wifi_delay_ms_cb(uint32_t msec)
{
  bk7258_wifi_osal_delay_ms(msec);
  return 0;
}

static uint32_t bk7258_wifi_time_cb(void)
{
  return (uint32_t)bk7258_wifi_osal_time_ms();
}

static uint32_t bk7258_wifi_enter_critical_cb(void)
{
  return bk7258_wifi_osal_enter_critical();
}

static void bk7258_wifi_exit_critical_cb(uint32_t flags)
{
  bk7258_wifi_osal_exit_critical(flags);
}

