JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_adapter.c
static unsigned long bk7258_wifi_ms_to_ticks_cb(unsigned long ms)
{
  return (unsigned long)MSEC2TICK(ms);
}

static uint32_t bk7258_wifi_ms_per_tick_cb(void)
{
  return MSEC_PER_TICK;
}

static bk_err_t bk7258_wifi_dma_memcpy_cb(void *out, const void *in,
                                          uint32_t len)
{
  return dma_memcpy(out, in, len);
}

static bk_err_t bk7258_wifi_isr_register_cb(uint32_t src, void *isr, void *arg)
{
  return bk_int_isr_register((icu_int_src_t)src,
                             (int_group_isr_t)isr, arg);
}

static int32 bk7258_wifi_sys_drv_int_enable_cb(uint32 param)
{
  return (int32)sys_drv_int_enable(param);
}

static int32 bk7258_wifi_sys_drv_int_disable_cb(uint32 param)
{
  return (int32)sys_drv_int_disable(param);
}

static int32 bk7258_wifi_sys_drv_int_group2_enable_cb(uint32 param)
{
  return (int32)sys_drv_int_group2_enable(param);
}

static int32 bk7258_wifi_sys_drv_int_group2_disable_cb(uint32 param)
{
  return (int32)sys_drv_int_group2_disable(param);
}

static int32 bk7258_wifi_sys_drv_module_power_state_get_cb(uint32_t module)
{
  return (int32)sys_drv_module_power_state_get((power_module_name_t)module);
}

static bk_err_t bk7258_wifi_pm_vote_sleep_cb(uint32_t module,
                                              uint32_t sleep_state,
                                              uint32_t sleep_time)
{
  return bk_pm_module_vote_sleep_ctrl((pm_sleep_module_name_e)module,
                                      (uint32)sleep_state, (uint32)sleep_time);
}

static uint32_t bk7258_wifi_pm_lpo_src_cb(void)
{
  uint32_t v = (uint32_t)bk_pm_lpo_src_get();
  static uint32_t last;
  static bool first = true;

  if (first || v != last)
    {
      first = false;
      last = v;
      syslog(LOG_INFO, "[BK7258-WIFI] pmq: lpo_src=%u\n", v);
    }

  return v;
}

static int32 bk7258_wifi_pm_module_power_state_cb(unsigned int module)
{
  return bk_pm_module_power_state_get((pm_power_module_name_e)module);
}

static bk_err_t bk7258_wifi_pm_vote_power_cb(unsigned int module,
                                              uint32_t power_state)
{
  return bk_pm_module_vote_power_ctrl((pm_power_module_name_e)module,
                                      (pm_power_module_state_e)power_state);
}

static bk_err_t bk7258_wifi_pm_vote_cpu_freq_cb(uint32_t module,
                                                 uint32_t cpu_freq)
{
  /* Behavioral logger (bring-up diagnostic): crm_clk_set feeds the mode
   * code it computed through this slot; the log line reveals the live
   * rwnxl_compute_cpu_freq output that selects the clk_config row. */
  bk_err_t ret = bk_pm_module_vote_cpu_freq((pm_dev_id_e)module,
                                            (pm_cpu_freq_e)cpu_freq);
  syslog(LOG_INFO,
         "[BK7258-WIFI] pmq: vote_cpu_freq(module=%u freq=%u) ret=%d\n",
         module, cpu_freq, (int)ret);
  return ret;
}

static uint64_t bk7258_wifi_aon_rtc_tick_cb(uint32_t id)
{
  return bk_aon_rtc_get_current_tick((aon_rtc_id_t)id);
}

static float bk7258_wifi_rtc_ms_tick_cb(void)
{
  return (float)bk_rtc_get_ms_tick_count();
}

static pm_cb_notify g_bk7258_wifi_32k_ready_cb;

static void bk7258_wifi_mac_ps_exc32_init_cb(void *callback)
{
  pm_cb_extern32k_cfg_t config = {0};

  config.cb_module = PM_32K_MODULE_WIFI;
  config.cb_func = (pm_cb_extern32k)callback;
  if (pm_extern32k_register_cb(&config) != BK_OK)
    {
      bk_printf("[BK7258-WIFI] extern32k callback registration failed\n");
    }
}

static void bk7258_wifi_32k_ready_register_cb(void *callback)
{
  g_bk7258_wifi_32k_ready_cb = (pm_cb_notify)callback;
}

static void bk7258_wifi_mac_ps_exc32_notify_cb(void)
{
  if (g_bk7258_wifi_32k_ready_cb != NULL)
    {
      g_bk7258_wifi_32k_ready_cb();
    }
}

static bk_err_t bk7258_wifi_queue_send_cb(void **queue, void *msg, uint32_t t)
{ return rtos_push_to_queue((beken_queue_t *)queue, msg, t); }
static bool bk7258_wifi_queue_full_cb(void **queue)
{ return rtos_is_queue_full((beken_queue_t *)queue); }
static bool bk7258_wifi_queue_empty_cb(void **queue)
{ return rtos_is_queue_empty((beken_queue_t *)queue); }
static bk_err_t bk7258_wifi_queue_recv_cb(void **queue, void *msg, uint32_t t)
{ return rtos_pop_from_queue((beken_queue_t *)queue, msg, t); }
static bk_err_t bk7258_wifi_queue_front_cb(void **queue, void *msg, uint32_t t)
{ return rtos_push_to_queue_front((beken_queue_t *)queue, msg, t); }
static bk_err_t bk7258_wifi_sem_init_cb(void **sem, int max)
{ return rtos_init_semaphore((beken_semaphore_t *)sem, max); }
static bk_err_t bk7258_wifi_sem_wait_cb(void **sem, uint32_t t)
{ return rtos_get_semaphore((beken_semaphore_t *)sem, t); }
static bk_err_t bk7258_wifi_sem_deinit_cb(void **sem)
{ return rtos_deinit_semaphore((beken_semaphore_t *)sem); }
static int bk7258_wifi_sem_post_cb(void **sem)
{ return rtos_set_semaphore((beken_semaphore_t *)sem); }
static bk_err_t bk7258_wifi_thread_create_cb(void **thread, uint8_t p,
                                             const char *name, void *fn,
                                             uint32_t stack, void *arg)
{ return rtos_create_thread((beken_thread_t *)thread, p, name, fn, stack, arg); }
static bk_err_t bk7258_wifi_thread_delete_cb(void **thread)
{ return rtos_delete_thread((beken_thread_t *)thread); }
static bool bk7258_wifi_is_current_thread_cb(void **thread)
{ return rtos_is_current_thread((beken_thread_t *)thread); }
static bk_err_t bk7258_wifi_queue_init_cb(void **q, const char *name,
                                          uint32_t size, uint32_t count)
{ return rtos_init_queue((beken_queue_t *)q, name, size, count); }
static bk_err_t bk7258_wifi_queue_deinit_cb(void **q)
{ return rtos_deinit_queue((beken_queue_t *)q); }
static bk_err_t bk7258_wifi_mutex_init_cb(void **m)
{ return rtos_init_mutex((beken_mutex_t *)m); }
static bk_err_t bk7258_wifi_mutex_deinit_cb(void **m)
{ return rtos_deinit_mutex((beken_mutex_t *)m); }
static int bk7258_wifi_timer_init_cb(void *timer, uint32_t ms, void *fn, void *arg)
{ return rtos_init_timer((beken_timer_t *)timer, ms, (timer_handler_t)fn, arg); }
static bk_err_t bk7258_wifi_timer_reload_cb(void *timer)
{ return rtos_reload_timer((beken_timer_t *)timer); }
static bool bk7258_wifi_timer_running_cb(void *timer)
{ return rtos_is_timer_running((beken_timer_t *)timer); }
static int bk7258_wifi_timer_stop_cb(void *timer)
{ return rtos_stop_timer((beken_timer_t *)timer); }

