JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_adapter.c
static void bk7258_wifi_register_dump_hook_cb(void *wifi_func)
{
  rtos_regist_wifi_dump_hook((hook_func)wifi_func);
}

/* CSV batch-closure providers.  Each mirrors a source-backed Armino adapter
 * operation or an explicit NuttX-owned compatibility contract; none reports a
 * hardware or network capability that this port does not own. */
static void bk7258_wifi_mac_printf_encode_cb(char *txt, size_t maxlen,
                                              const u8 *data, size_t len)
{
  char *end;
  size_t index;

  if (txt == NULL || maxlen == 0)
    {
      return;
    }

  end = txt + maxlen;
  for (index = 0; index < len; index++)
    {
      if (txt + 4 >= end)
        {
          break;
        }

      switch (data[index])
        {
          case '\"':
            *txt++ = '\\';
            *txt++ = '\"';
            break;
          case '\\':
            *txt++ = '\\';
            *txt++ = '\\';
            break;
          case '\033':
            *txt++ = '\\';
            *txt++ = 'e';
            break;
          case '\n':
            *txt++ = '\\';
            *txt++ = 'n';
            break;
          case '\r':
            *txt++ = '\\';
            *txt++ = 'r';
            break;
          case '\t':
            *txt++ = '\\';
            *txt++ = 't';
            break;
          default:
            if (data[index] >= 32 && data[index] <= 126)
              {
                *txt++ = (char)data[index];
              }
            else
              {
                txt += snprintf(txt, (size_t)(end - txt), "\\x%02x",
                                data[index]);
              }
            break;
        }
    }

  *txt = '\0';
}

static void bk7258_wifi_set_sta_status_cb(void *info)
{
  if (info == NULL)
    {
      bk_printf("[BK7258-WIFI] _set_sta_status received NULL info\n");
      PANIC();
    }

  mhdr_set_station_status(*(wifi_linkstate_reason_t *)info);
}

static void bk7258_wifi_rtos_assert_cb(uint32_t expression)
{
  if (expression == 0)
    {
      bk_printf("[BK7258-WIFI] vendor rtos assertion failed\n");
      PANIC();
    }
}

static int bk7258_wifi_shell_assert_out_cb(bool continue_execution,
                                            char *format, ...)
{
  char message[160];
  va_list ap;

  va_start(ap, format);
  (void)vsnprintf(message, sizeof(message), format, ap);
  va_end(ap);
  bk_printf("[BK7258-WIFI] vendor assertion: %s", message);

  if (continue_execution)
    {
      return 1;
    }

  PANIC();
}

static void *bk7258_wifi_get_netif_hostname_cb(void *netif)
{
  static char hostname[] = "bk7258";

  (void)netif;
  return hostname;
}

static uint32_t bk7258_wifi_lwip_ntohl_cb(uint32_t value)
{
  return ntohl(value);
}

static uint16_t bk7258_wifi_lwip_htons_cb(uint16_t value)
{
  return htons(value);
}

static void bk7258_wifi_net_begin_send_arp_reply_cb(int is_send_arp,
                                                     int is_allow_send_req)
{
  net_begin_send_arp_reply(is_send_arp, is_allow_send_req);
}

/* The adapter ABI predates the RF arbitration API.  The former accepts a
 * legacy command/parameter pair, while BK7258's provider accepts a complete
 * arbitration request.  Preserve the two documented Wi-Fi PLL hold commands
 * and deliberately reject every other legacy command rather than guessing an
 * RF operation. */
static UINT32 bk7258_wifi_rf_pll_ctrl_cb(UINT32 cmd, UINT32 param)
{
  enum RF_PLL_E pll;

  (void)param;

  if (cmd == CMD_RF_WIFIPLL_HOLD_BIT_SET)
    {
      pll = RF_PLL_HIGH;
    }
  else if (cmd == CMD_RF_WIFIPLL_HOLD_BIT_CLR)
    {
      pll = RF_PLL_LOW;
    }
  else
    {
      return (UINT32)RF_ARBIT_RESULT_ERROR;
    }

  return (UINT32)rf_pll_ctrl(MODULE_TYPE_WIFI, RF_OPERATION_APPLY,
                             RF_PATH_WIFI_IQ, pll,
                             RF_PRIORITY_WIFI_NORMAL, true);
}

/* The BK7258 PHY provider consumes a 2.4-GHz center frequency in MHz.  It
 * does not reject arbitrary values above 2400 before encoding freq - 2400 in
 * a hardware field, so validate the ABI boundary before entering it. */
static bool bk7258_wifi_is_valid_2g_freq(UINT32 freq)
{
  return freq == 2484 ||
         (freq >= 2412 && freq <= 2472 && ((freq - 2412) % 5) == 0);
}

static void bk7258_wifi_cal_set_channel_cb(UINT32 freq)
{
  if (!bk7258_wifi_is_valid_2g_freq(freq))
    {
      bk_printf("[BK7258-WIFI] invalid capability argument: "
                "_rwnx_cal_set_channel freq=%lu MHz\n",
                (unsigned long)freq);
      PANIC();
    }

  rwnx_cal_set_channel(freq);
}

/* This symbol exists in the linked PHY archive, but its BK7258 RX-retuning
 * contract has not been established.  Upstream only enables it on BK7236, so
 * preserve a diagnostic trap rather than pretending the operation succeeded. */
/* The authoritative BK7258 initializer binds these slots to the pinned
 * archives' own implementations (bk7011_update_by_rx is a no-op wrapper on
 * BK7258 upstream; restore_all_regs_for_mac is the real MAC-register restore
 * used around mac sleep transitions).  The earlier diagnostic PANIC traps are
 * therefore replaced by the real providers, matching Armino exactly instead
 * of trapping on paths the SDK itself services.  _bk_wifi_stop_rf closes the
 * RF through the same vote controller the SDK uses; STA-only profile always
 * votes with RF_BY_WIFI_BIT. */

extern void restore_all_regs_for_mac(void);
extern void delay05us(INT32 num);
extern void bk7011_update_by_rx(int8_t rssi, int8_t freq_offset);

static void bk7258_wifi_stop_rf_cb(void)
{
  rf_module_vote_ctrl(RF_CLOSE, RF_BY_WIFI_BIT);
}

static void bk7258_wifi_bt_state_notify_disabled_cb(uint8_t is_active)
{
  /* This is notification-only in the selected BT-less profile.  Keep the
   * missing coexistence integration visible without inventing a BT/PTA
   * implementation or blocking the STA-only power transition. */
  bk_printf("[BK7258-WIFI] unsupported capability: "
            "_wifi_notify_state_to_bt state=%u (BT/coex disabled)\n",
            (unsigned int)is_active);
}

