JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_adapter.c
/* Real power/clock/RF-control providers for the scan/RF enablement chain.
 *
 * Board evidence (2026-08-28 scan trace): every probe-request TX was released
 * by txl_cntrl_tx_check() with the NX MAC master FSM read as 0/0x0/0x0
 * (0x49100500/0x49100504), so no probe ever reached the air.  The Armino SDK
 * initializer binds _wifi_mac_phy_power_on, _wifi_vote_rf_ctrl,
 * _wifi_phy_clk_open/close and _bk_wifi_set_rf_en to real power/clock/RF
 * providers; this port previously left them unset.  These callbacks bind the
 * pinned BK7258 archives' own implementations (libbk_phy.a rf_cntrl.c.obj /
 * bk7236_cal.c.obj) plus the team sysctrl/clock helpers whose register bits
 * were verified against the authoritative mapping (SYS+0x40 bits 9/10,
 * SYS+0xC bits 26/27).  Keep the owner selected by the caller: the authority
 * routes a zero is_wifi argument to the BLE voter, so collapsing it to Wi-Fi
 * corrupts the PHY clock-vote ownership bitmap. */

static void bk7258_wifi_mac_phy_power_on_cb(void)
{
  /* Matches the authoritative wifi_mac_phy_power_on_wrapper exactly
   * (vendored bk_wifi_adapter.c:426-436): three PM power votes then two
   * clock enables.  The PHY_WIFI submodule vote is NOT redundant -- it
   * drives the PM submodule refcount and, on first power-on, calls
   * phy_wakeup_reinit() inside the closed library.  The previous
   * implementation called bk7258_phy_power() directly, bypassing that
   * state machine entirely. */

  bk_err_t ret;

  ret = bk_pm_module_vote_power_ctrl(PM_POWER_MODULE_NAME_WIFIP_MAC,
                                      PM_POWER_MODULE_STATE_ON);
  if (ret != BK_OK)
    syslog(LOG_ERR, "[BK7258-WIFI] mpo FAIL mac_power ret=%d\n", ret);

  ret = bk_pm_module_vote_power_ctrl(PM_POWER_MODULE_NAME_PHY,
                                      PM_POWER_MODULE_STATE_ON);
  if (ret != BK_OK)
    syslog(LOG_ERR, "[BK7258-WIFI] mpo FAIL phy_power ret=%d\n", ret);

  ret = bk_pm_module_vote_power_ctrl(PM_POWER_SUB_MODULE_NAME_PHY_WIFI,
                                      PM_POWER_MODULE_STATE_ON);
  if (ret != BK_OK)
    syslog(LOG_ERR, "[BK7258-WIFI] mpo FAIL phy_wifi ret=%d\n", ret);

  ret = bk_pm_clock_ctrl(PM_CLK_ID_MAC, PM_CLK_CTRL_PWR_UP);
  if (ret != BK_OK)
    syslog(LOG_ERR, "[BK7258-WIFI] mpo FAIL mac_clock ret=%d\n", ret);

  ret = bk_pm_clock_ctrl(PM_CLK_ID_PHY, PM_CLK_CTRL_PWR_UP);
  if (ret != BK_OK)
    syslog(LOG_ERR, "[BK7258-WIFI] mpo FAIL phy_clock ret=%d\n", ret);
}

static void bk7258_wifi_vote_rf_ctrl_cb(uint8_t cmd)
{
  rf_module_vote_ctrl(cmd, RF_BY_WIFI_BIT);
}

static void bk7258_wifi_phy_clk_open_cb(uint8_t is_wifi)
{
  if (is_wifi)
    {
      phy_clk_open_handler(RF_BY_WIFI_BIT);
    }
  else
    {
      phy_clk_open_handler(RF_BY_BLE_BIT);
    }
}

static void bk7258_wifi_phy_clk_close_cb(uint8_t is_wifi)
{
  if (is_wifi)
    {
      phy_clk_close_handler(RF_BY_WIFI_BIT);
    }
  else
    {
      phy_clk_close_handler(RF_BY_BLE_BIT);
    }
}

/* Blind-spot closure (2026-08-28 full-archive scan): every wifi_os_funcs_t
 * slot the pinned libwifi.a/libbk_phy.a can dereference was cross-checked
 * against the port bindings; the wrappers below close the NULL gaps so no
 * 7236XX-family path can BLX through a zero slot.  Each wrapper copies the
 * authoritative BK7258 profile binding: commented-out bodies stay empty,
 * CKMN returns OK without CONFIG_CKMN, WAPI stays NULL exactly as upstream.
 * _send_udp_bc_pkt (airkiss) and the low-analog pair have no provider in
 * this profile; they log once and return instead of pretending success. */

static void power_save_delay_sleep_check_cb(void) { }
static void power_save_wake_mac_rf_if_in_sleep_cb(void) { }
static void power_save_wake_mac_rf_end_clr_flag_cb(void) { }
static UINT8 power_save_if_ps_rf_dtim_enabled_cb(void) { return 0; }
static UINT16 power_save_forbid_trace_cb(UINT16 forbid)
{
  (void)forbid;
  return 0;
}
static int ps_need_pre_process_cb(UINT32 arg)
{
  (void)arg;
  return 0;
}
static bool power_save_rf_sleep_check_cb(void) { return false; }
static void mac_ps_bcn_callback_cb(uint8_t *data, int len)
{
  (void)data;
  (void)len;
}
static UINT8 mac_sleeped_cb(void) { return 0; }
static bk_err_t bk_ckmn_driver_get_rc32k_ppm_cb(void) { return BK_OK; }
static UINT32 mcu_ps_machw_cal_cb(void) { return 0; }
static UINT32 mcu_ps_machw_reset_cb(void) { return 0; }
static UINT32 mcu_ps_machw_init_cb(void) { return 0; }
static void mcu_ps_bcn_callback_cb(uint8_t *data, int len)
{
  (void)data;
  (void)len;
}
static void dbg_enable_debug_gpio_cb(void) { }
static bk_err_t bk7258_wifi_gpio_unmap_cb(uint32_t id)
{
  return gpio_dev_unmap((gpio_id_t)id);
}
static bk_err_t bk7258_wifi_gpio_map_cb(uint32_t id, uint32_t dev)
{
  return gpio_dev_map((gpio_id_t)id, (gpio_dev_t)dev);
}
/* Transcribed from the authority's cache driver semantics
 * (cp/middleware/arch/cm33/cache.c:37-42): flush = Clean + Invalidate over the
 * whole D-cache.  The old body here was an empty no-op from the pre-cache era;
 * the port now runs with CONFIG_ARCH_DCACHE=y, and with the slot empty the
 * closed library gets no writeback before whichever DMA handoff it guards --
 * exactly the "silent data corruption on the MAC data path" our own
 * hal_port/include/cache.h:12-16 warns about.  NuttX exposes the two halves
 * separately (arm_cache.c:895/:737), so the authority's single
 * CleanInvalidateDCache is spelled as clean-then-invalidate; the net cache
 * state is the same (every line written back and invalidated). */
static void flush_all_dcache_cb(void)
{
  up_clean_dcache_all();
  up_invalidate_dcache_all();
}
static uint32_t bk7258_wifi_udp_bc_pkt_cb(u8 random_data)
{
  static bool reported;
  if (!reported) { reported = true;
    bk_printf("[BK7258-WIFI] capability: _send_udp_bc_pkt (airkiss) not in profile\n"); }
  (void)random_data;
  return 0;
}
extern void bk7258_wifi_pwd_ofdm_override(uint32_t v);
extern uint32_t bk7258_wifi_pwd_ofdm_get_override(void);
extern void sys_hal_enter_low_analog(void);
extern void sys_hal_exit_low_analog(void);

static void bk7258_wifi_enter_low_analog_cb(void)
{
  /* Authority sys_pm_hal.c:1281, imported under pm/authority.  Was a local
   * hp_ hand-port until 2026-09-09. */
  sys_hal_enter_low_analog();
  return;
}
#if 0
static void bk7258_wifi_enter_low_analog_cb_unused(void)
{
  static bool reported;
  if (!reported) { reported = true;
    bk_printf("[BK7258-WIFI] capability: _sys_hal_enter_low_analog not in profile\n"); }
}
#endif

static void bk7258_wifi_exit_low_analog_cb(void)
{
  sys_hal_exit_low_analog();
  return;
}
#if 0
static void bk7258_wifi_exit_low_analog_cb_unused(void)
{
  static bool reported;
  if (!reported) { reported = true;
    bk_printf("[BK7258-WIFI] capability: _sys_hal_exit_low_analog not in profile\n"); }
}
#endif
extern uint32_t hp_rc_drv_get_rx_mode_enrxsw(void);
extern void hp_rc_drv_set_rx_mode_enrxsw(uint32_t en);
extern void hp_rc_drv_set_agc_manual_en(uint32_t en);
extern int hp_os_vsnprintf(char *buf, uint32_t size, const char *fmt, va_list ap);
extern int hp_net_wlan_add_netif(uint8_t vif_idx);
extern int hp_net_wlan_remove_netif(uint8_t vif_idx);
extern int hp_sta_ip_start(void);
extern int hp_sta_ip_down(void);
extern int hp_sta_ip_mode_set(uint32_t mode);
extern int hp_uap_ip_start(void);
extern int hp_uap_ip_down(void);
extern char *hp_inet_ntoa(uint32_t ip);
extern uint32_t hp_lookup_ipaddr(const char *name);
extern void hp_get_net_info(void *info);
extern void hp_save_net_info(void *netif, void *sta);
extern int hp_set_sta_status(uint32_t status);
extern void hp_do_evm(void *param);
extern void hp_do_rx_sensitivity(void);
extern void hp_evm_via_mac_evt(void);
extern void hp_evm_via_mac_continue(void);
extern uint32_t hp_tx_evm_rate_get(void);
extern uint32_t hp_tx_evm_bandwidth_get(void);
extern uint32_t hp_tx_evm_mode_get(void);
extern uint32_t hp_tx_evm_guard_i_tpye_get(void);
extern uint32_t hp_tx_evm_modul_format_get(void);
extern uint32_t hp_tx_evm_pwr_idx_get(void);
extern int hp_wapi_wpi_encrypt(void *param);
extern int hp_wapi_wpi_decrypt(void *param);
extern uint32_t hp_get_pbuf_pool_size(void);
extern uint32_t hp_get_rx_pbuf_type(void);

static void tx_verify_test_call_back_cb(void) { }

extern bk_err_t bk_wifi_get_vendor_ie_cb_internal(void *vendor_ie, uint32_t vendor_type, uint16_t len, uint8_t frame_type);
extern uint32_t bk_wifi_get_vendor_ie_type(void);
extern uint8_t bk_wifi_get_vendor_ie_oui_len(void);
extern void bk_wifi_csi_info_cb(void *data);

/* ABI-complete objects: designated initializers preserve the generated
 * layout while leaving unported P3-P5 callbacks visibly NULL. Runtime startup
 * remains disabled until those rows are replaced by real providers. */

/* Adjacency pins the RF/power callback group exactly as the generated
 * adapter header lays it out (vote/clk-open/clk-close/mac-power-on), so any
 * regeneration that reorders them breaks the link instead of silently
 * misbinding the pinned providers. */
_Static_assert(offsetof(wifi_os_funcs_t, _wifi_phy_clk_open)
               == offsetof(wifi_os_funcs_t, _wifi_vote_rf_ctrl) + 4,
               "libwifi.a ABI: PHY clock-open offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _wifi_phy_clk_close)
               == offsetof(wifi_os_funcs_t, _wifi_phy_clk_open) + 4,
               "libwifi.a ABI: PHY clock-close offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _wifi_mac_phy_power_on)
               == offsetof(wifi_os_funcs_t, _wifi_phy_clk_close) + 4,
               "libwifi.a ABI: MAC/PHY power-on offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _bk_wifi_set_rf_en) > 0,
               "libwifi.a ABI: RF-enable callback missing");

_Static_assert(offsetof(wifi_os_funcs_t, _bk_feature_get_mac_sup_sta_max_num)
               == 0x204,
               "libwifi.a ABI: station-count callback offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _sys_is_enable_hw_tpc) == 0x1c,
               "libwifi.a ABI: hardware-TPC callback offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _bk_feature_send_deauth_before_connect)
               == 0x1dc,
               "libwifi.a ABI: send-deauth callback offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _rtos_disable_int) == 0x230,
               "libwifi.a ABI: IRQ-mask callback offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _register_wifi_dump_hook) == 0x2e0,
               "libwifi.a ABI: dump-hook callback offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _tpc_change_pwr_by_media) == 0x340,
               "libwifi.a ABI: media-TPC changer offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _tpc_set_media_pwr_level) == 0x344,
               "libwifi.a ABI: media-TPC setter offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _tpc_get_media_pwr_level) == 0x348,
               "libwifi.a ABI: media-TPC getter offset changed");
_Static_assert(offsetof(wifi_os_funcs_t, _rwnx_cal_recover_rcbeken_reg_val)
               == 0x84,
               "libwifi.a ABI: PHY calibration-restore callback offset changed");
_Static_assert(offsetof(phy_os_funcs_t, _aon_pmu_hal_get_chipid) == 0x84,
               "libbk_phy.a ABI: PHY AON chip-ID callback offset changed");
_Static_assert(offsetof(phy_os_funcs_t, _sys_ll_get_ana_reg5_adc_div) == 0x94,
               "libbk_phy.a ABI: PHY ANA5 ADC-divider callback offset changed");

wifi_os_funcs_t g_wifi_os_funcs =
{
  ._version = BK_WIFI_OS_ADAPTER_VERSION,
  /* RF capability entries below are backed by the linked BK PHY/runtime
   * implementation; do not replace them with synthetic success values. */
  ._manual_cal_rfcali = manual_cal_rfcali_status,
  /* 权威不填此槽。函数本体在 libbk_phy.a 里（两边同有），库需要时直调即可；
   * 挂表只会激活权威没有的表内路径。退回 NULL 与权威逐槽相等。 */
  //._rc_drv_set_rf_en = rc_drv_set_rf_en,
  ._rc_drv_get_rf_en = rc_drv_get_rf_en,
  /* Scan-probe TX chain requires real RF/power control; see the provider
   * block above for the board evidence that motivated these bindings. */
  ._wifi_vote_rf_ctrl = bk7258_wifi_vote_rf_ctrl_cb,
  ._wifi_phy_clk_open = bk7258_wifi_phy_clk_open_cb,
  ._wifi_phy_clk_close = bk7258_wifi_phy_clk_close_cb,
  ._wifi_mac_phy_power_on = bk7258_wifi_mac_phy_power_on_cb,
  ._bk_wifi_set_rf_en = bk_wifi_set_rf_en,
  ._bk_wifi_stop_rf = bk7258_wifi_stop_rf_cb,
  ._delay05us = delay05us,
  /* blind-spot closure bindings, authoritative semantics per wrapper */
  ._power_save_delay_sleep_check = power_save_delay_sleep_check_cb,
  ._power_save_wake_mac_rf_if_in_sleep = power_save_wake_mac_rf_if_in_sleep_cb,
  ._power_save_wake_mac_rf_end_clr_flag = power_save_wake_mac_rf_end_clr_flag_cb,
  ._power_save_if_ps_rf_dtim_enabled = power_save_if_ps_rf_dtim_enabled_cb,
  ._power_save_forbid_trace = power_save_forbid_trace_cb,
  ._ps_need_pre_process = ps_need_pre_process_cb,
  ._power_save_rf_sleep_check = power_save_rf_sleep_check_cb,
  ._mac_ps_bcn_callback = mac_ps_bcn_callback_cb,
  ._mac_sleeped = mac_sleeped_cb,
  ._bk_ckmn_driver_get_rc32k_ppm = bk_ckmn_driver_get_rc32k_ppm_cb,
  ._dbg_enable_debug_gpio = dbg_enable_debug_gpio_cb,
  ._gpio_dev_unprotect_unmap = bk7258_wifi_gpio_unmap_cb,
  ._gpio_dev_unprotect_map = bk7258_wifi_gpio_map_cb,
  ._mcu_ps_machw_cal = mcu_ps_machw_cal_cb,
  ._mcu_ps_machw_reset = mcu_ps_machw_reset_cb,
  ._mcu_ps_machw_init = mcu_ps_machw_init_cb,
  ._mcu_ps_bcn_callback = mcu_ps_bcn_callback_cb,
  ._bk_feature_csi_out_cb = bk_wifi_csi_info_cb,
  ._bk_wifi_get_vendor_ie_cb_internal = bk_wifi_get_vendor_ie_cb_internal,
  ._bk_wifi_get_vendor_ie_type = bk_wifi_get_vendor_ie_type,
  ._bk_wifi_get_vendor_ie_oui_len = bk_wifi_get_vendor_ie_oui_len,
  ._flush_all_dcache = flush_all_dcache_cb,
  ._send_udp_bc_pkt = bk7258_wifi_udp_bc_pkt_cb,
  ._tx_verify_test_call_back = tx_verify_test_call_back_cb,
  ._sys_hal_enter_low_analog = bk7258_wifi_enter_low_analog_cb,
  ._sys_hal_exit_low_analog = bk7258_wifi_exit_low_analog_cb,
  ._cal_set_rfconfig_BTPLL = rwnx_cal_set_rfconfig_BTPLL,
  ._cal_set_rfconfig_WIFIPLL = rwnx_cal_set_rfconfig_WIFIPLL,
  ._calibration_init = calibration_init,
  ._sys_is_enable_hw_tpc = rwnx_sys_is_enable_hw_tpc,
  ._rwnx_cal_save_trx_rcbekn_reg_val = rwnx_cal_save_trx_rcbekn_reg_val,
  ._rwnx_tpc_get_pwridx_by_rate = rwnx_tpc_get_pwridx_by_rate,
  ._rwnx_is_enable_pwr_change_by_rssi = rwnx_is_enable_pwr_change_by_rssi,
  ._tpc_auto_change_pwr_by_rssi = tpc_auto_change_pwr_by_rssi,
  /* BK7258 is a BK7236-family part, so Armino's CONFIG_SOC_BK7236XX branch
   * binds this exact media-TPC trio.  These slots are not optional for the
   * active authority configuration. */
  ._tpc_change_pwr_by_media = tpc_change_pwr_by_media,
  ._tpc_set_media_pwr_level = tpc_set_media_pwr_level,
  ._tpc_get_media_pwr_level = tpc_get_media_pwr_level,
  ._bk7011_max_rxsens_setting = bk7011_max_rxsens_setting,
  ._bk7011_default_rxsens_setting = bk7011_default_rxsens_setting,
  ._rwnx_setting_for_single_rate = rwnx_setting_for_single_rate,
  ._rwnx_cal_recover_rf_setting = rwnx_cal_recover_rf_setting,
  ._rwnx_cal_recover_wifi_setting = rwnx_cal_recover_wifi_setting,
  ._rwnx_cal_set_40M_setting = rwnx_cal_set_40M_setting,
  ._rwnx_cal_set_20M_setting = rwnx_cal_set_20M_setting,
  ._rwnx_cal_recover_rcbeken_reg_val = rwnx_cal_recover_rcbeken_reg_val,
  ._rwnx_cal_recover_trx_reg_val = rwnx_cal_recover_trx_reg_val,
  ._rwnx_cal_set_channel = bk7258_wifi_cal_set_channel_cb,
  ._bk7011_cal_pll = bk7011_cal_pll,
  ._bk7011_update_by_rx = bk7011_update_by_rx,
  ._rwnx_cal_load_trx_rcbekn_reg_val = rwnx_cal_load_trx_rcbekn_reg_val,
  ._manual_get_epa_flag = manual_get_epa_flag,
  ._rxsens_start_flag_get = rxsens_start_flag_get,
  ._os_malloc = bk7258_wifi_os_malloc_cb,
  ._os_zalloc = bk7258_wifi_os_zalloc_cb,
  ._os_free = bk7258_wifi_os_free_cb,
  ._rtos_realloc = bk7258_wifi_os_realloc_cb,
  ._os_memcmp = bk7258_wifi_memcmp_cb,
  ._os_memset = bk7258_wifi_memset_cb,
  ._os_memcpy = bk7258_wifi_memcpy_cb,
  ._os_memmove = bk7258_wifi_memmove_cb,
  ._os_strlen = bk7258_wifi_strlen_cb,
  ._os_strcmp = bk7258_wifi_strcmp_cb,
  ._os_strncmp = bk7258_wifi_strncmp_cb,
  ._os_strcpy = bk7258_wifi_strcpy_cb,
  ._os_strncpy = bk7258_wifi_strncpy_cb,
  ._os_strchr = bk7258_wifi_strchr_cb,
  ._os_strrchr = bk7258_wifi_strrchr_cb,
  ._os_strstr = bk7258_wifi_strstr_cb,
  ._os_strdup = bk7258_wifi_strdup_cb,
  ._os_strlcpy = bk7258_wifi_strlcpy_cb,
  ._os_snprintf = bk7258_wifi_snprintf_cb,
  ._os_strtoul = bk7258_wifi_strtoul_cb,
  ._os_strcasecmp = bk7258_wifi_strcasecmp_cb,
  ._os_strncasecmp = bk7258_wifi_strncasecmp_cb,
  ._ate_is_enabled = ate_is_enabled,
  ._bk_feature_receive_bcmc_enable = bk_feature_receive_bcmc_enable,
  ._bk_feature_bssid_connect_enable = bk_feature_bssid_connect_enable,
  ._bk_feature_fast_connect_enable = bk_feature_fast_connect_enable,
  ._bk_feature_send_deauth_before_connect =
    bk_feature_send_deauth_before_connect,
  ._bk_feature_fast_dhcp_enable = bk_feature_fast_dhcp_enable,
  ._bk_feature_get_scan_speed_level = bk_feature_get_scan_speed_level,
  ._bk_feature_not_check_ssid_enable = bk_feature_not_check_ssid_enable,
  ._bk_feature_config_cache_enable = bk_feature_config_cache_enable,
  ._bk_feature_config_ckmn_enable = bk_feature_ckmn_enable,
  ._bk_feature_sta_vsie_enable = bk_feature_sta_vsie_enable,
  ._bk_feature_ap_statype_limit_enable = bk_feature_ap_statype_limit_enable,
  ._bk_feature_close_coexist_csa = bk_feature_close_coexist_csa,
  ._bk_feature_network_found_event = bk_feature_network_found_event,
  ._bk_feature_get_mac_sup_sta_max_num =
    bk_feature_get_mac_sup_sta_max_num,
  ._sys_drv_modem_bus_clk_ctrl = sys_drv_modem_bus_clk_ctrl,
  ._sys_drv_modem_clk_ctrl = sys_drv_modem_clk_ctrl,
  ._sys_drv_int_enable = bk7258_wifi_sys_drv_int_enable_cb,
  ._sys_drv_int_disable = bk7258_wifi_sys_drv_int_disable_cb,
  ._sys_drv_int_group2_enable = bk7258_wifi_sys_drv_int_group2_enable_cb,
  ._sys_drv_int_group2_disable = bk7258_wifi_sys_drv_int_group2_disable_cb,
  ._sys_ll_set_cpu_power_sleep_wakeup_pwd_ofdm =
    bk7258_wifi_pwd_ofdm_override,
  ._sys_ll_get_cpu_power_sleep_wakeup_pwd_ofdm =
    bk7258_wifi_pwd_ofdm_get_override,
  ._sys_ll_get_cpu_device_clk_enable_mac_cken =
    sys_ll_get_cpu_device_clk_enable_mac_cken,
  ._sys_ll_get_cpu_device_clk_enable_phy_cken =
    sys_ll_get_cpu_device_clk_enable_phy_cken,
  ._sys_drv_module_power_state_get =
    bk7258_wifi_sys_drv_module_power_state_get_cb,
  ._bk_pm_module_vote_sleep_ctrl = bk7258_wifi_pm_vote_sleep_cb,
  ._bk_pm_lpo_src_get = bk7258_wifi_pm_lpo_src_cb,
  ._bk_pm_module_power_state_get = bk7258_wifi_pm_module_power_state_cb,
  ._bk_pm_module_vote_power_ctrl = bk7258_wifi_pm_vote_power_cb,
  ._bk_pm_module_vote_cpu_freq = bk7258_wifi_pm_vote_cpu_freq_cb,
  ._bk_pm_phy_reinit_flag_get = bk_pm_phy_reinit_flag_get,
  ._bk_pm_phy_reinit_flag_clear = bk_pm_phy_reinit_flag_clear,
  ._bk_pm_sleep_register = bk_pm_sleep_register_wrapper,
  ._bk_pm_low_voltage_register = bk_pm_low_voltage_register_wrapper,
  ._mac_ps_exc32_cb_notify = bk7258_wifi_mac_ps_exc32_notify_cb,
  ._mac_ps_exc32_init = bk7258_wifi_mac_ps_exc32_init_cb,
  ._wifi_32k_src_switch_ready_notify =
    bk7258_wifi_32k_ready_register_cb,
  ._rwnx_cal_mac_sleep_rc_clr = rwnx_cal_mac_sleep_rc_clr,
  ._rwnx_cal_mac_sleep_rc_recover = rwnx_cal_mac_sleep_rc_recover,
  ._rtos_get_time = bk7258_wifi_time_cb,
  ._rtos_enter_critical = bk7258_wifi_enter_critical_cb,
  ._rtos_exit_critical = bk7258_wifi_exit_critical_cb,
  ._rtos_delay_milliseconds = bk7258_wifi_delay_ms_cb,
  /* ._delay 曾填 bk7258_wifi_delay_cb（按毫秒睡）。退回 NULL 以与权威逐槽
   * 相等：权威 adapter 不填此槽且实测可用，故库对它必然判空跳过 —— 填了反而
   * 激活权威从未走过的路径，且参数语义（ms? tick?）无从考证（无权威语义可抄）。
   * 风险场景：表调用在 core 线程上执行，若闭源库用它等待，我们的 ms 阻塞会
   * 停摆整个 core 线程、CFM 得不到处理 —— 与未解释的间歇 rw_msg_send 超时
   * （reqid 1/6173/7169/7172）形态吻合。退回 NULL 后该嫌疑整体消失。
   * bk7258_wifi_delay_cb 本体保留（可能有别的引用），不再挂表。 */
  //._delay = bk7258_wifi_delay_cb,
  ._rc_drv_get_rx_mode_enrxsw = hp_rc_drv_get_rx_mode_enrxsw,
  ._rc_drv_set_rx_mode_enrxsw = hp_rc_drv_set_rx_mode_enrxsw,
  ._rc_drv_set_agc_manual_en = hp_rc_drv_set_agc_manual_en,
  ._net_wlan_add_netif = hp_net_wlan_add_netif,
  ._net_wlan_remove_netif = hp_net_wlan_remove_netif,
  /* 权威不填此槽（lwIP 层拥有 sta_ip_start，库不走表）。本 port 的对应义务
   * 由 plan §11.4.3 承担：连接成功 → runtime app 侧 carrier_on + DHCPC，
   * 与这个槽无关。hp_sta_ip_start 的 no-op 本体保留。退回 NULL 与权威逐槽
   * 相等，避免激活权威从未走过的表内路径。 */
  //._sta_ip_start = hp_sta_ip_start,
  ._sta_ip_down = hp_sta_ip_down,
  ._sta_ip_mode_set = hp_sta_ip_mode_set,
  ._uap_ip_start = hp_uap_ip_start,
  ._uap_ip_down = hp_uap_ip_down,
  ._inet_ntoa = hp_inet_ntoa,
  ._lookup_ipaddr = hp_lookup_ipaddr,
  ._get_net_info = hp_get_net_info,
  ._save_net_info = hp_save_net_info,

  /* ._set_sta_status intentionally NOT set here -- see the note at the
   * ._set_sta_status assignment further down.  It was assigned twice in this
   * same initializer and C silently keeps the LAST one, so this line was dead
   * while looking live. */

