JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/bk7258_wifi_adapter.c
  ._do_evm = hp_do_evm,
  ._do_rx_sensitivity = hp_do_rx_sensitivity,
  ._evm_via_mac_evt = hp_evm_via_mac_evt,
  ._evm_via_mac_continue = hp_evm_via_mac_continue,
  ._tx_evm_rate_get = hp_tx_evm_rate_get,
  ._tx_evm_bandwidth_get = hp_tx_evm_bandwidth_get,
  ._tx_evm_mode_get = hp_tx_evm_mode_get,
  ._tx_evm_guard_i_tpye_get = hp_tx_evm_guard_i_tpye_get,
  ._tx_evm_modul_format_get = hp_tx_evm_modul_format_get,
  ._tx_evm_pwr_idx_get = hp_tx_evm_pwr_idx_get,
  ._wapi_wpi_encrypt = hp_wapi_wpi_encrypt,
  ._wapi_wpi_decrypt = hp_wapi_wpi_decrypt,

  /* ._get_pbuf_pool_size / ._get_rx_pbuf_type intentionally NOT set here.
   *
   * DUPLICATE-INITIALIZER BUG, fixed 2026-09-01: both were assigned here AND
   * again below (to the bk_*_wrapper pair).  In a single initializer C keeps
   * the LAST assignment and GCC says nothing by default (-Woverride-init is
   * off), so these two lines were dead code that read as if the hal_port
   * implementations were in use.  They were also wrong: hp_get_rx_pbuf_type
   * returned lwIP's PBUF_RAM (a 0x0380 bit combination) where the slot's
   * contract is a bk_pbuf_type ordinal 0..4.  The surviving pair in
   * hal_port/pbuf_shim.c now returns BK_PBUF_RAM_RX, matching the authority.
   *
   * Checked at the same time: g_wifi_os_variable has no duplicates. */

  ._delay_us = bk7258_wifi_delay_us_cb,
  ._rtos_lock_mutex = bk7258_wifi_lock_mutex_cb,
  ._rtos_unlock_mutex = bk7258_wifi_unlock_mutex_cb,
  ._bk_ms_to_ticks = bk7258_wifi_ms_to_ticks_cb,
  ._dma_memcpy = bk7258_wifi_dma_memcpy_cb,
  ._rtos_get_ms_per_tick = bk7258_wifi_ms_per_tick_cb,
  /* KE calls this pair before its generic critical-section callbacks. Both
   * save and restore NuttX's interrupt mask through the same OSAL contract. */
  ._rtos_disable_int = bk7258_wifi_enter_critical_cb,
  ._rtos_enable_int = bk7258_wifi_exit_critical_cb,
  ._bk_printf = bk_printf,
  ._bk_null_printf = bk_null_printf,
  ._log_raw = bk_printf_raw,
  ._bk_wifi_interrupt_init = bk_wifi_interrupt_init,
  ._bk_int_isr_register = bk7258_wifi_isr_register_cb,
  ._rtos_push_to_queue = bk7258_wifi_queue_send_cb,
  ._rtos_is_queue_full = bk7258_wifi_queue_full_cb,
  ._rtos_is_queue_empty = bk7258_wifi_queue_empty_cb,
  ._rtos_pop_from_queue = bk7258_wifi_queue_recv_cb,
  ._rtos_push_to_queue_front = bk7258_wifi_queue_front_cb,
  ._bk_aon_rtc_get_current_tick = bk7258_wifi_aon_rtc_tick_cb,
  ._rtos_init_queue = bk7258_wifi_queue_init_cb,
  ._rtos_deinit_queue = bk7258_wifi_queue_deinit_cb,
  ._rtos_init_semaphore = bk7258_wifi_sem_init_cb,
  ._rtos_get_semaphore = bk7258_wifi_sem_wait_cb,
  ._rtos_deinit_semaphore = bk7258_wifi_sem_deinit_cb,
  ._rtos_set_semaphore = bk7258_wifi_sem_post_cb,
  ._rtc_get_ms_tick_cnt = bk7258_wifi_rtc_ms_tick_cb,
  ._rtos_create_thread = bk7258_wifi_thread_create_cb,
  ._rtos_delete_thread = bk7258_wifi_thread_delete_cb,
  ._rtos_get_free_heap_size = rtos_get_free_heap_size,
  ._rtos_init_mutex = bk7258_wifi_mutex_init_cb,
  ._rtos_deinit_mutex = bk7258_wifi_mutex_deinit_cb,
  ._rtos_reload_timer = bk7258_wifi_timer_reload_cb,
  ._rtos_is_timer_running = bk7258_wifi_timer_running_cb,
  ._rtos_stop_timer = bk7258_wifi_timer_stop_cb,
  ._rtos_init_timer = bk7258_wifi_timer_init_cb,
  ._rtos_is_current_thread = bk7258_wifi_is_current_thread_cb,
  ._register_wifi_dump_hook = bk7258_wifi_register_dump_hook_cb,
  ._rf_pll_ctrl = bk7258_wifi_rf_pll_ctrl_cb,
  ._rw_msg_send = rw_msg_send,
  ._rw_ieee80211_init_scan_chan = rw_ieee80211_init_scan_chan,
  ._rw_ieee80211_get_scan_default_chan_num =
    rw_ieee80211_get_scan_default_chan_num,
  ._rwnx_set_bk_rlk_start = rwnx_set_wifi_rlk_start,
  ._sr_get_scan_number = sr_get_scan_number,
  ._sr_get_scan_results = sr_get_scan_results,
  ._sr_flush_scan_results = sr_flush_scan_results,
  ._rwnx_get_rlk_info_results = rwnx_get_rlk_info_results,
  ._rwnx_flush_rlk_info_results = rwnx_flush_rlk_info_results,
  ._wifi_notify_state_to_bt = bk7258_wifi_bt_state_notify_disabled_cb,
  ._bk_restore_all_regs_for_mac = restore_all_regs_for_mac,
  ._pbuf_alloc = bk_pbuf_alloc_wrapper,
  ._pbuf_free = bk_pbuf_free_wrapper,
  ._pbuf_ref = bk_pbuf_ref_wrapper,
  ._pbuf_header = bk_pbuf_header_wrapper,
  ._pbuf_cat = bk_pbuf_cat_wrapper,
  ._pbuf_coalesce = bk_pbuf_coalesce_wrapper,
  ._get_rx_pbuf_type = bk_get_rx_pbuf_type_wrapper,
  ._get_pbuf_pool_size = bk_get_pbuf_pool_size_wrapper,
  ._get_netif_hostname = bk7258_wifi_get_netif_hostname_cb,
  ._lwip_ntohl = bk7258_wifi_lwip_ntohl_cb,
  ._lwip_htons = bk7258_wifi_lwip_htons_cb,
  ._set_sta_status = bk7258_wifi_set_sta_status_cb,
  ._net_begin_send_arp_reply = bk7258_wifi_net_begin_send_arp_reply_cb,
  ._mac_printf_encode = bk7258_wifi_mac_printf_encode_cb,
  ._shell_assert_out = bk7258_wifi_shell_assert_out_cb,
  ._rtos_assert = bk7258_wifi_rtos_assert_cb,
  ._log = bk_printf_ext,
  ._bk_task_wdt_feed = bk_task_wdt_feed,
};

/*
 * This table is an ABI input to the pinned libwifi.a.  Use designated
 * initializers so its generated layout remains the source of truth and so a
 * future ABI expansion is visibly reviewed.  The zero-valued rows below are
 * intentional: BK7258 has no verified equivalent for the debug register,
 * low-power settling delays, or HSU interrupt routing.  They must not be
 * inferred from a neighbouring Beken SoC.
 */
wifi_os_variable_t g_wifi_os_variable =
{
  ._sys_drv_clk_on = SYS_DRV_CLK_ON,

  ._ps_forbid_in_doze = PS_FORBID_IN_DOZE,
  ._ps_forbid_txing = PS_FORBID_TXING,
  ._ps_forbid_hw_timer = PS_FORBID_HW_TIMER,
  ._ps_forbid_vif_prevent = PS_FORBID_VIF_PREVENT,
  ._ps_forbid_keevt_on = PS_FORBID_KEEVT_ON,
  ._ps_bmsg_iotcl_rf_timer_init = PS_BMSG_IOCTL_RF_PS_TIMER_INIT,
  ._ps_bmsg_ioctl_rf_ps_timer_deint = PS_BMSG_IOCTL_RF_PS_TIMER_DEINIT,
  ._ps_bmsg_ioctl_rf_enable = PS_BMSG_IOCTL_RF_ENABLE,
  ._ps_bmsg_ioctl_mcu_enable = PS_BMSG_IOCTL_MCU_ENABLE,
  ._ps_bmsg_ioctl_mcu_disable = PS_BMSG_IOCTL_MCU_DISANABLE,
  ._ps_bmsg_ioctl_ps_enable = PS_BMSG_IOCTL_PS_ENABLE,
  ._ps_bmsg_ioctl_ps_disable = PS_BMSG_IOCTL_PS_DISANABLE,
  ._ps_bmsg_ioctl_exc32k_start = PS_BMSG_IOCTL_EXC32K_START,
  ._ps_bmsg_ioctl_exc32k_stop = PS_BMSG_IOCTL_EXC32K_STOP,

  ._pm_lpo_src_divd = PM_LPO_SRC_DIVD,
  ._pm_lpo_src_x32k = PM_LPO_SRC_X32K,
  ._pm_lpo_src_rosc = PM_LPO_SRC_ROSC,
  ._pm_power_module_name_btsp = PM_POWER_MODULE_NAME_BTSP,
  ._pm_power_module_name_wifip_mac = PM_POWER_MODULE_NAME_WIFIP_MAC,
  ._pm_power_module_name_phy = PM_POWER_MODULE_NAME_PHY,
  ._pm_power_module_state_off = PM_POWER_MODULE_STATE_OFF,
  ._pm_power_module_state_on = PM_POWER_MODULE_STATE_ON,
  ._pm_power_sub_module_name_phy_wifi = PM_POWER_SUB_MODULE_NAME_PHY_WIFI,
  ._pm_sleep_module_name_wifip_mac = PM_SLEEP_MODULE_NAME_WIFIP_MAC,
  ._pm_dev_id_mac = PM_DEV_ID_MAC,
  ._pm_cpu_frq_60m = PM_CPU_FRQ_60M,
  ._pm_cpu_frq_80m = PM_CPU_FRQ_80M,
  ._pm_cpu_frq_120m = PM_CPU_FRQ_120M,
  ._pm_cpu_frq_high = PM_CPU_FRQ_480M,
  ._pm_cpu_frq_default = PM_CPU_FRQ_60M,
  ._pm_32k_step_begin = PM_32K_STEP_BEGIN,
  ._pm_32k_step_finish = PM_32K_STEP_FINISH,

  /* Low-power clock-switch timing constants (values from the
   * authoritative bk_wifi_adapter.c / bk7258 sys_types.h):
   *  xtal_dpll_stability = (0.29ms DPLL + 0.75ms restore) * 1000 = 1040
   *  hardware delay = 500us; 26M stability = 1800us (project config).
   * The library consumes these during sleep/wake clock transitions;
   * leaving them unbound left the timing at 0. */
  ._low_power_xtal_dpll_stability_delay_time = 1040,
  ._low_power_delay_time_hardware = 500,
  ._low_power_26m_stability_delay_time_hardware = 1800,
  /* WIFI_HSU interrupt enable bit: CPU0_INT_32_63_EN bit0 (WIFI_HSU). */
  ._wifi_hsu_interrupt_ctrl_bit = 1,
  /* Low-voltage wakeup lead time and debug config register address. */
  /* 0 -> 188: the authority fills
   * PM_LOW_VOLTAGE_DELTA_WAKEUP_DELAY_IN_US = ceil(DELTA*1e6/RTC_CLOCK_FREQ),
   * DELTA = (0xb+0xb+3)-(8+8+3) = 6 (cp/middleware/soc/bk7258/hal/sys_types.h
   * :115-130), RTC_CLOCK_FREQ = 32000 in this profile -> 188.  The 0 was
   * flagged in the value-table work as strictly worse than the real number
   * ("tells the library the wakeup delay is zero"); the pinned libwifi.a is a
   * PM_V2=1 build and may read this slot, so it gets the authority's number,
   * not a guess. */
  ._pm_low_voltage_delta_wakeup_delay_in_us = 188,
  ._sys_sys_debug_config1_addr = 0x44010000 + (0x39 << 2),

  ._cmd_rf_wifipll_hold_bit_set = CMD_RF_WIFIPLL_HOLD_BIT_SET,
  ._cmd_rf_wifipll_hold_bit_clr = CMD_RF_WIFIPLL_HOLD_BIT_CLR,
  ._rf_wifipll_hold_by_wifi_bit = RF_WIFIPLL_HOLD_BY_WIFI_BIT,

  ._wifi_modem_en = WIFI_MODEM_EN,
  ._wifi_modem_rc_en = WIFI_MODEM_RC_EN,
  ._wifi_mac_tx_rx_timer_int_bit = WIFI_MAC_TX_RX_TIMER_INT_BIT,
  ._wifi_mac_tx_rx_misc_int_bit = WIFI_MAC_TX_RX_MISC_INT_BIT,
  ._wifi_mac_rx_trigger_int_bit = WIFI_MAC_RX_TRIGGER_INT_BIT,
  ._wifi_mac_tx_trigger_int_bit = WIFI_MAC_TX_TRIGGER_INT_BIT,
  ._wifi_mac_port_trigger_int_bit = WIFI_MAC_PORT_TRIGGER_INT_BIT,
  ._wifi_mac_gen_int_bit = WIFI_MAC_GEN_INT_BIT,
  ._wifi_mac_wakeup_int_bit = WIFI_MAC_WAKEUP_INT_BIT,
  ._int_src_mac_general = INT_SRC_MAC_GENERAL,
  ._int_src_mac_rx_trigger = INT_SRC_MAC_RX_TRIGGER,
  ._int_src_mac_txrx_timer = INT_SRC_MAC_TXRX_TIMER,
  ._int_src_mac_prot_trigger = INT_SRC_MAC_PROT_TRIGGER,
  ._int_src_mac_tx_trigger = INT_SRC_MAC_TX_TRIGGER,
  ._int_src_modem = INT_SRC_MODEM,
  ._int_src_modem_rc = INT_SRC_MODEM_RC,

  ._improve_he_tb_enable = false,
  ._ble_polar_enable = false,
};

void bk7258_wifi_adapter_bind(void)
{
  g_wifi_funcs = &g_wifi_os_funcs;
  g_wifi_vars = &g_wifi_os_variable;
}
